#include QMK_KEYBOARD_H
#include "keymap_french_osx.h"

// readability
#define _______ KC_TRNS
#define XXXXXXX KC_NO

const uint16_t PROGMEM keymaps[][MATRIX_ROWS][MATRIX_COLS] = {

	/* Layer 0
	 * ,-----------------------------------------------------------------------------------.
	 * | Esc  |   A  |   W  |   E  |   R  |   T  |   Y  |   U  |   I  |   O  |   P  | Bksp |
	 * |------+------+------+------+------+-------------+------+------+------+------+------|
	 * | Tab  |   A  |   S  |   D  |   F  |   G  |   H  |   J  |   K  |   L  |   M  |Enter |
	 * |------+------+------+------+------+------|------+------+------+------+------+------|
	 * | Shift|   Z  |   X  |   C  |   V  |   B  |   N  |   ,  |   ;  |   :  |  =   |  `   |
	 * |------+------+------+------+------+------+------+------+------+------+------+------|
	 * |   <  | CTRL | Alt  | Cmd |Layer1|    Space    |Layer2|  Lef | Down | Up   |Right |
	 * `-----------------------------------------------------------------------------------'
	 */
	[0] = LAYOUT_planck_mit(
		KC_ESC,  FR_A,    FR_Z,    KC_E,    KC_R,  KC_T,   KC_Y,   KC_U,     KC_I,    KC_O,    KC_P,    KC_BSPC,
		KC_TAB,  FR_Q,    KC_S,    KC_D,    KC_F,  KC_G,   KC_H,   KC_J,     KC_K,    KC_L,    FR_M,    KC_ENT,
		KC_LSFT, FR_W,    KC_X,    KC_C,    KC_V,  KC_B,   KC_N,   FR_COMM,  FR_SCLN, FR_COLN, FR_EQL,  FR_GRV,
		FR_AT, KC_LCTL, KC_LALT, KC_LGUI, MO(1),     KC_SPC,     MO(2),    KC_LEFT, KC_DOWN, KC_UP,   KC_RGHT
  ),
   
	/* Layer 1
	 * ,-----------------------------------------------------------------------------------.
	 * |   @  |   &  |   é  |   "  |   '  |   (  |   §  |   è  |   !  |   ç  |   à  |      |
	 * |------+------+------+------+------+-------------+------+------+------+------+------|
	 * |      |      |       |  [   |  ]  |      |      |      |      |  °   |  ^   |  $   |
	 * |------+------+------+------+------+------|------+------+------+------+------+------|
	 * |      |      |       |      |      |      |  ~   |      |      |  |   |  ù  |  `   |
	 * |------+------+------+------+------+------+------+------+------+------+------+------|
	 * |      |      |      |      |      |      |      |      |      |      |      |      |
	 * `-----------------------------------------------------------------------------------'
	 */
	[1] = LAYOUT_planck_mit(
		FR_LESS,   KC_1,    KC_2,    KC_3,    KC_4,    KC_5,    KC_6,    KC_7,    KC_8,    KC_9,    KC_0,    KC_BSPC,
		_______, _______, _______, FR_LBRC, FR_RBRC, _______, _______, _______, _______, FR_RPRN, FR_CIRC, KC_RBRC,
		_______, _______, _______, _______, _______, _______, FR_TILD, _______, _______, FR_PIPE, FR_UGRV, FR_GRV,
		_______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______
	),

	/* Layer 2 (r_ Indicates RGB Controls)
	 * ,-----------------------------------------------------------------------------------.
	 * |      |      |      |      |   (  |    )  |      |      |      |      |   -  |  Del |
	 * |------+------+------+------+------+-------------+------+------+------+------+------|
	 * |      |      |      |      |   {  |   }  | Prev | Play | Next | Vol- | Vol+ | Mute |
	 * |------+------+------+------+------+------|------+------+------+------+------+------|
	 * |      |      |      |     |      |      |      |      |      |      |      |      |
	 * |------+------+------+------+------+------+------+------+------+------+------+------|
	 * |Reset |BL_TOG|BL_STEP|      |      |      |      |      |r_TOG |r_Mode|r_Hue+|r_Hue-|
	 * `-----------------------------------------------------------------------------------'
	 */
	[2] = LAYOUT_planck_mit(
		_______, _______, _______, FR_LPRN, FR_RPRN, _______, _______, _______, _______, _______, FR_MINS, KC_DELT,
		_______, _______, _______, FR_LCBR, FR_RCBR, _______, KC_MPRV, KC_MPLY, KC_MNXT, KC_VOLD, KC_VOLU, KC_MUTE,
		_______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______, _______,
		RESET,   BL_TOGG, BL_STEP, _______, _______, _______, _______, RGB_TOG, RGB_MOD, RGB_HUI, RGB_HUD
  )
};


void matrix_init_user(void) {
}

void matrix_scan_user(void) {
}

bool process_record_user(uint16_t keycode, keyrecord_t *record) {
	return true;
}

void led_set_user(uint8_t usb_led) {

	if (usb_led & (1 << USB_LED_NUM_LOCK)) {

	} else {

	}

	if (usb_led & (1 << USB_LED_CAPS_LOCK)) {

	} else {

	}

	if (usb_led & (1 << USB_LED_SCROLL_LOCK)) {

	} else {

	}

	if (usb_led & (1 << USB_LED_COMPOSE)) {

	} else {

	}

	if (usb_led & (1 << USB_LED_KANA)) {

	} else {

	}

}
